[
{
  "title": "Oppenheimer",
  "year": 2023,
  "cast": [
    "Cillian Murphy",
    "Emily Blunt",
    "Matt Damon",
    "Robert Downey Jr.",
    "Rami Malek",
    "Florence Pugh",
    "Benny Safdie",
    "Michael Angarano",
    "Josh Hartnett",
    "Kenneth Branagh",
    "Dane DeHaan",
    "Dylan Arnold",
    "David Krumholtz",
    "Alden Ehrenreich",
    "Matthew Modine"
  ],
  "genres": [
    "Biography"
  ],
  "href": "Oppenheimer_(film)",
  "extract": "Oppenheimer is an upcoming biographical film written and directed by Christopher Nolan. It is based on American Prometheus, a biography written by Kai Bird and Martin J. Sherwin. The film stars Cillian Murphy as J. Robert Oppenheimer, an American theoretical physicist credited with being the \"father of the atomic bomb\" for his role in the Manhattan Project—the World War II undertaking that developed the first nuclear weapons, with a supporting ensemble cast that includes Emily Blunt, Robert Downey Jr., Matt Damon, Rami Malek, Florence Pugh, Benny Safdie, Michael Angarano, Josh Hartnett and Kenneth Branagh. It is a co-production between Universal Pictures, Syncopy Inc. and Atlas Entertainment, with Nolan producing the film alongside Emma Thomas and Charles Roven.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4a/Oppenheimer_%28film%29.jpg",
  "thumbnail_width": 251,
  "thumbnail_height": 397,
  "trailer": "https://www.youtube.com/watch?v=bK6ldnjE3Y0"
},
{
  "title": "Barbie",
  "year": 2023,
  "cast": [
    "Margot Robbie",
    "Ryan Gosling",
    "America Ferrera",
    "Kate McKinnon",
    "Issa Rae",
    "Rhea Perlman",
    "Hari Nef",
    "Alexandra Shipp",
    "Emma Mackey",
    "Connor Swindells",
    "Michael Cera",
    "Sharon Rooney",
    "John Cena",
    "Kingsley Ben-Adir",
    "Simu Liu",
    "Ariana Greenblatt",
    "Scott Evans",
    "Jamie Demetriou",
    "Dua Lipa",
    "Ncuti Gatwa",
    "Nicola Coughlan",
    "Emerald Fennell",
    "Ana Cruz Kayne",
    "Will Ferrell",
    "Helen Mirren"
  ],
  "genres": [
    "Comedy"
  ],
  "href": "Barbie_(film)",
  "extract": "Barbie is an upcoming comedy film directed by Greta Gerwig, who co-wrote it with Noah Baumbach. Based on the Barbie fashion dolls by Mattel, the film is the first live-action Barbie film after several computer-animated direct-to-video and streaming television films. The film stars Margot Robbie and Ryan Gosling as Barbie and Ken, respectively, alongside a large ensemble supporting cast.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0b/Barbie_2023_poster.jpg",
  "thumbnail_width": 260,
  "thumbnail_height": 385,
  "trailer":"https://www.youtube.com/watch?v=pBk4NYhWNMM"
},
{
  "title": "Blue Beetle",
  "year": 2023,
  "cast": [
    "Xolo Maridueña",
    "Adriana Barraza",
    "Damián Alcázar",
    "Elpidia Carrillo",
    "Bruna Marquezine",
    "Raoul Max Trujillo",
    "Susan Sarandon",
    "George Lopez"
  ],
  "genres": [
    "Superhero"
  ],
  "href": "Blue_Beetle_(film)",
  "extract": "Blue Beetle is an upcoming American superhero film based on the DC Comics character Jaime Reyes / Blue Beetle, produced by DC Studios and the Safran Company, and directed by Angel Manuel Soto from a screenplay by Gareth Dunnet-Alcocer. It is intended to be the 14th film in the DC Extended Universe (DCEU). The film stars Xolo Maridueña as Jaime Reyes / Blue Beetle alongside Adriana Barraza, Damián Alcázar, Elpidia Carrillo, Bruna Marquezine, Raoul Max Trujillo, Susan Sarandon, and George Lopez.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c1/Blue_Beetle_poster.jpg",
  "thumbnail_width": 259,
  "thumbnail_height": 384,
  "trailer": "https://www.youtube.com/watch?v=vS3_72Gb-bI"
},
{
  "title": "Don't Worry Darling",
  "year": 2022,
  "cast": [
    "Florence Pugh",
    "Harry Styles",
    "Olivia Wilde",
    "Gemma Chan",
    "KiKi Layne",
    "Nick Kroll",
    "Chris Pine"
  ],
  "genres": [
    "Thriller"
  ],
  "href": "Don%27t_Worry_Darling",
  "extract": "Don't Worry Darling is a 2022 American psychological thriller film directed by Olivia Wilde from a screenplay by Katie Silberman, based on a spec script by Carey Van Dyke, Shane Van Dyke, and Silberman. The film stars Florence Pugh, Harry Styles, Wilde, Gemma Chan, KiKi Layne, Nick Kroll, and Chris Pine. The film follows a housewife living in an idyllic company town who begins to suspect a sinister secret being kept from its residents by the man who runs it.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4c/Don%27t_Worry_Darling_Poster_2.jpg",
  "thumbnail_width": 250,
  "thumbnail_height": 370,
  "trailer":"https://www.youtube.com/watch?v=SZ2elR3OmWI"
},
{
  "title": "Everything Everywhere All at Once",
  "year": 2022,
  "cast": [
    "Michelle Yeoh",
    "Stephanie Hsu",
    "Ke Huy Quan",
    "Jenny Slate",
    "Harry Shum Jr.",
    "James Hong",
    "Jamie Lee Curtis"
  ],
  "genres": [
    "Comedy",
    "Drama",
    "Science Fiction"
  ],
  "href": "Everything_Everywhere_All_at_Once",
  "extract": "Everything Everywhere All at Once is a 2022 American absurdist science fiction comedy-drama film written and directed by Daniel Kwan and Daniel Scheinert, who produced it with Anthony and Joe Russo and Jonathan Wang. Michelle Yeoh stars as Evelyn Quan Wang, a Chinese-American immigrant who, while being audited by the IRS, discovers that she must connect with parallel universe versions of herself to prevent a powerful being from destroying the multiverse. The film also stars Stephanie Hsu, Ke Huy Quan, Jamie Lee Curtis, Jenny Slate, Harry Shum Jr., and James Hong in supporting roles. And it was fun. They had a lot of fun when they made this movie. It was fun to watch too",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1e/Everything_Everywhere_All_at_Once.jpg",
  "thumbnail_width": 250,
  "thumbnail_height": 370,
  "trailer":"https://www.youtube.com/watch?v=wxN1T1uxQ2g"
},
{
  "title": "The Batman",
  "year": 2022,
  "cast": [
    "Robert Pattinson",
    "Zoë Kravitz",
    "Paul Dano",
    "Jeffrey Wright",
    "John Turturro",
    "Peter Sarsgaard",
    "Barry Keoghan",
    "Andy Serkis",
    "Colin Farrell"
  ],
  "genres": [
    "Superhero"
  ],
  "href": "The_Batman_(film)",
  "extract": "The Batman is a 2022 American superhero film based on the DC Comics character Batman. Produced by Warner Bros. Pictures, DC Films, 6th & Idaho, and Dylan Clark Productions, and distributed by Warner Bros. Pictures, it is a reboot of the Batman film franchise. The film was directed by Matt Reeves, who wrote the screenplay with Peter Craig. It stars Robert Pattinson as Bruce Wayne / Batman alongside Zoë Kravitz, Paul Dano, Jeffrey Wright, John Turturro, Peter Sarsgaard, Andy Serkis, and Colin Farrell. The film sees Batman, who has been fighting crime in Gotham City for two years, uncover corruption while pursuing the Riddler (Dano), a serial killer who targets Gotham's corrupt elite.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/ff/The_Batman_%28film%29_poster.jpg",
  "thumbnail_width": 236,
  "thumbnail_height": 350,
  "trailer":"https://www.youtube.com/watch?v=mqqft2x_Aa4"
},
{
  "title": "Avatar: The Way of Water",
  "year": 2022,
  "cast": [
    "Sam Worthington",
    "Zoe Saldaña",
    "Sigourney Weaver",
    "Stephen Lang",
    "Kate Winslet"
  ],
  "genres": [
    "Science Fiction"
  ],
  "href": "Avatar:_The_Way_of_Water",
  "extract": "Avatar: The Way of Water is a 2022 American epic science fiction film directed and produced by James Cameron. He co-wrote the screenplay with Rick Jaffa and Amanda Silver from a story the trio wrote with Josh Friedman and Shane Salerno. Distributed by 20th Century Studios, it is the sequel to Avatar (2009) and the second installment in the Avatar film series. Cast members Sam Worthington, Zoe Saldaña, Stephen Lang, Joel David Moore, CCH Pounder, Giovanni Ribisi, Dileep Rao, and Matt Gerald reprise their roles from the original film, with Sigourney Weaver returning in an additional role while Kate Winslet joined the cast. It follows a blue-skinned humanoid Na'vi named Jake Sully (Worthington) as he and his family, under renewed human threat, seek refuge with the aquatic Metkayina clan of Pandora, a habitable exomoon on which they live.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/54/Avatar_The_Way_of_Water_poster.jpg",
  "thumbnail_width": 250,
  "thumbnail_height": 390,
  "trailer":"https://www.youtube.com/watch?v=d9MyW72ELq0"
},
{
  "title": "Hocus Pocus 2",
  "year": 2022,
  "cast": [
    "Bette Midler",
    "Sarah Jessica Parker",
    "Kathy Najimy",
    "Sam Richardson",
    "Doug Jones",
    "Whitney Peak",
    "Belissa Escobedo",
    "Tony Hale",
    "Hannah Waddingham"
  ],
  "genres": [
    "Comedy",
    "Fantasy"
  ],
  "href": "Hocus_Pocus_2",
  "extract": "Hocus Pocus 2 is a 2022 American fantasy comedy film directed by Anne Fletcher, written by Jen D'Angelo and produced by Walt Disney Pictures. A sequel to the 1993 film Hocus Pocus, it stars Bette Midler, Sarah Jessica Parker, Kathy Najimy, and Doug Jones reprising their roles, with Sam Richardson, Whitney Peak, Belissa Escobedo, Tony Hale, and Hannah Waddingham joining the cast in new roles.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f4/Hocus_Pocus_2_Logo.jpg",
  "thumbnail_width": 259,
  "thumbnail_height": 383,
  "trailer":"https://www.youtube.com/watch?v=idc0EOmKr30"
},
{
  "title": "Spider-Man: Across the Spider-Verse",
  "year": 2023,
  "cast": [
    "Shameik Moore",
    "Hailee Steinfeld",
    "Jake Johnson",
    "Issa Rae",
    "Daniel Kaluuya",
    "Karan Soni",
    "Jason Schwartzman",
    "Brian Tyree Henry",
    "Luna Lauren Vélez",
    "Greta Lee",
    "Rachel Dratch",
    "Jorma Taccone",
    "Shea Whigham",
    "Oscar Isaac"
  ],
  "genres": [
    "Animated",
    "Superhero"
  ],
  "href": "Spider-Man:_Across_the_Spider-Verse",
  "extract": "Spider-Man: Across the Spider-Verse is an upcoming American computer-animated superhero film featuring the Marvel Comics character Miles Morales / Spider-Man. It is produced by Columbia Pictures and Sony Pictures Animation in association with Marvel Entertainment, and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Into the Spider-Verse (2018) and is set in a shared multiverse of alternate universes called the \"Spider-Verse\". The film is directed by Joaquim Dos Santos, Kemp Powers, and Justin K. Thompson, from a screenplay written by Phil Lord, Christopher Miller, and David Callaham. Shameik Moore voices Miles, starring alongside Hailee Steinfeld, Jake Johnson, Issa Rae, Daniel Kaluuya, Karan Soni, Jason Schwartzman, Brian Tyree Henry, Luna Lauren Vélez, Greta Lee, Rachel Dratch, Jorma Taccone, Shea Whigham and Oscar Isaac. In the film, Miles goes on an adventure with Gwen Stacy / Spider-Woman across the multiverse where he meets a new team of Spider-People, known as the Spider-Society, but comes into conflict with them over handling a new threat.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b4/Spider-Man-_Across_the_Spider-Verse_poster.jpg",
  "thumbnail_width": 263,
  "thumbnail_height": 379,
  "trailer":"https://www.youtube.com/watch?v=cqGjhVJWtEg"
},
{
  "title": "The Little Mermaid",
  "year": 2023,
  "cast": [
    "Halle Bailey",
    "Jonah Hauer-King",
    "Daveed Diggs",
    "Awkwafina",
    "Jacob Tremblay",
    "Noma Dumezweni",
    "Javier Bardem",
    "Melissa McCarthy"
  ],
  "genres": [
    "Fantasy",
    "Musical"
  ],
  "href": "The_Little_Mermaid_(2023_film)",
  "extract": "The Little Mermaid is an upcoming American musical fantasy film directed by Rob Marshall from a screenplay written by David Magee. It is a live-action adaptation of Disney's 1989 animated film of the same name, which itself is loosely based on the 1837 fairy tale of the same title by Hans Christian Andersen. The film stars Halle Bailey in the titular role, Jonah Hauer-King, Daveed Diggs, Awkwafina, Jacob Tremblay, Noma Dumezweni, Javier Bardem, and Melissa McCarthy.",
  "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f4/The_Little_Mermaid_%282023_film%29.png",
  "thumbnail_width": 260,
  "thumbnail_height": 385,
  "trailer":"https://www.youtube.com/watch?v=kpGo2_d3oYE"
  }
]
